import { create } from 'zustand';
import { createJSONStorage, persist } from 'zustand/middleware'

import AsyncStorage from '@react-native-async-storage/async-storage';



export type ThekrType = {
    textId: number | string;
    text: string;
    counter: number;
    resetCounter: number
}
export type AzkarType = {
    id: number | string;
    title: string;
    content: ThekrType[];
};

export type AzkarStoreType = {
    element: AzkarType[];
};
export const useAzkarStore = create<AzkarStoreType>()(persist((set, get) => ({

    element: [
        {
            id: 1,
            title: 'أذكـار الصباح',
            content: [
                {
                    textId: '11',
                    text: `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].`,
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '12',
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 4,
                    resetCounter: 4
                },
                {
                    textId: '13',
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 3,
                    resetCounter: 3
                },
            ],
        },
        {
            id: 2,
            title: 'أذكـار المساء',
            content: [
                {
                    textId: '21',
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1,
                    resetCounter: 1
                    
                },
                {
                    textId: '22',
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '23',
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1,
                    resetCounter: 1
                },
            ],
        },
        {
            id: 3,
            title: 'أذكـار بعد الصلاة',
            content: [
                {
                    textId: '31',
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '32',
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '33',
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1,
                    resetCounter: 1
                },
            ],
        },
        {
            id: 4,
            title: 'أذكـار النوم',
            content: [
                {
                    textId: '41',
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '42',
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '43',
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1,
                    resetCounter: 1
                },
            ],
        },
        {
            id: 5,
            title: 'أذكـار الاستيقاظ',
            content: [
                {
                    textId: '51',
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '52',
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1,
                    resetCounter: 1
                },
                {
                    textId: '53',
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1,
                    resetCounter: 1
                },
            ],
        },
        
    
    ],

    
    
}), {
    name: 'azkar-storage',
    storage: createJSONStorage(() => AsyncStorage),
}));
