import { create } from 'zustand';

export type duaType ={
    id: number | string 
    title: string;
    description: string;
 
}

export type thekrType = {
    textId: number | string;
    text: string;
    counter: number;
}
export type ElementType = {
    id: number | string;
    title: string;
    content: thekrType[];

};



export type ElementStore = {
    element: ElementType[];
    favourites: thekrType[];
    dua: duaType[];
    addToFavourites: (ele: thekrType) => void;
    decrementCounter: (itemId: number | string, contentId: number | string) => void 
    namesOfAllah: { id: number; text: string; color: string, description: string }[];
};

const useElementStore = create<ElementStore>((set) => ({
    element: [
        {
            id: 1,
            title: 'أذكـار الصباح',
            content: [
                {
                    textId: 1,
                    text: `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].`,
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 4
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 3
                },
            ],
        },
        {
            id: 2,
            title: 'أذكـار المساء',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 3,
            title: 'أذكـار بعد الصلاة',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 4,
            title: 'أذكـار النوم',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 5,
            title: 'أذكـار الاستيقاظ',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 6,
            title: 'أذكـار الآذان',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 7,
            title: 'أذكـار خروج الـمنزل ودخولـه',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
    ],

    dua: [
        {   
            id: 1,
            title: "دعاء دخول الجنة ",
            description: "اللَّهمَّ إنِّي أسألُكَ الجنَّةَ وما قرَّبَ إليها من قَولٍ أو عملٍ، وأعوذُ بِكَ منَ النَّارِ وما قرَّبَ إليها من قولٍ أو عملٍ، وأسألُكَ أن تجعلَ كلَّ قَضاءٍ قضيتَهُ لي خيرًا",
            
        },
        {
            id: 2,
            title: "دعاء السفر",
            description: "اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب وسوء المنظر في الأهل والمال آيبون تائبون عابدون ولربنا حامدون",
            
        }
        
    ],


    namesOfAllah: [
        { id: 1, text: 'اللَّهُ', color: '#c5e3e9', description: '111111111111111' },
        { id: 2, text: 'الرَّحْمَنُ', color: '#d8e9c5', description: '222222222222' },
        { id: 3, text: 'الرَّحِيمُ', color: '#b1bace', description: '333333333333333' },
        { id: 4, text: 'الْمَلِكُ', color: '#d7ccc8', description: '44444444444444444' },
        // { id: 5, text: 'الْقُدُّوسُ', color: '#ffe0b2' },
        // { id: 6, text: 'السَّلَامُ', color: '#fff9c4' },
        // { id: 7, text: 'الْمُؤْمِنُ', color: '#f8bbd0' },
        // { id: 8, text: 'الْمُهَيْمِنُ', color: '#c8e6c9' },
        // { id: 9, text: 'الْعَزِيزُ', color: '#d1c4e9' },
        // { id: 10, text: 'الْجَبَّارُ', color: '#ffccbc' },
        // { id: 11, text: 'الْمُتَكَبِّرُ', color: '#bbdefb' },
        // { id: 12, text: 'الْخَالِقُ', color: '#cfd8dc' },
        // { id: 13, text: 'الْبَارِئُ', color: '#ffe0b2' },
        // { id: 14, text: 'الْمُصَوِّرُ', color: '#f0f4c3' },
        // { id: 15, text: 'الْأَوَّلُ', color: '#f8bbd0' },
        // { id: 16, text: 'الْآخِرُ', color: '#c5cae9' },
        // { id: 17, text: 'الظَّاهِرُ', color: '#dcedc8' },
        // { id: 18, text: 'الْبَاطِنُ', color: '#ffe0b2' },
        // { id: 19, text: 'الْمَالِكُ', color: '#bbdefb' },
        // { id: 20, text: 'الْمَلِيكُ', color: '#cfd8dc' },
        // { id: 21, text: 'الْهَادِي', color: '#ffe0b2' },
        // { id: 22, text: 'السَّمِيعُ', color: '#f0f4c3' },
        // { id: 23, text: 'الْبَصِيرُ', color: '#f8bbd0' },
        // { id: 24, text: 'الْوَاسِعُ', color: '#c5cae9' },
        // { id: 25, text: 'الْمُحِيطُ', color: '#dcedc8' },
        // { id: 26, text: 'عَلَّامُ الْغُيُوبِ', color: '#ffe0b2' },
        // { id: 27, text: 'الشَّاكِرُ', color: '#bbdefb' },
        // { id: 28, text: 'الْبَرُّ', color: '#cfd8dc' },
        // { id: 29, text: 'التَّوَّابُ', color: '#ffe0b2' },
        // { id: 30, text: 'الرَّؤُوفُ', color: '#f0f4c3' },
        // { id: 31, text: 'الْوَلِيُّ', color: '#f8bbd0' },
        // { id: 32, text: 'الْمَوْلَى', color: '#c5cae9' },
        // { id: 33, text: 'الرَّبُّ', color: '#dcedc8' },
        // { id: 34, text: 'الْخَلَّاقُ', color: '#ffe0b2' },
        // { id: 35, text: 'الْقَدِيرُ', color: '#bbdefb' },
        // { id: 36, text: 'النَّصِيرُ', color: '#cfd8dc' },
        // { id: 37, text: 'الْغَنِيُّ', color: '#ffe0b2' },
        // { id: 38, text: 'الْحَمِيدُ', color: '#f0f4c3' },
        // { id: 39, text: 'الْمَجِيدُ', color: '#f8bbd0' },
        // { id: 40, text: 'الْحَقُّ', color: '#c5cae9' },
        // { id: 41, text: 'الْمُبِينُ', color: '#dcedc8' },
        // { id: 42, text: 'الْقَوِيُّ', color: '#ffe0b2' },
        // { id: 43, text: 'الْمَتِينُ', color: '#bbdefb' },
        // { id: 44, text: 'الْمُنْتَقِمُ', color: '#cfd8dc' },
        // { id: 45, text: 'الْعَفُوُّ', color: '#ffe0b2' },
        // { id: 46, text: 'الْغَفُورُ', color: '#f0f4c3' },
        // { id: 47, text: 'الْحَلِيمُ', color: '#f8bbd0' },
        // { id: 48, text: 'الْقَرِيبُ', color: '#c5cae9' },
        // { id: 49, text: 'الْمُجِيبُ', color: '#dcedc8' },
        // { id: 50, text: 'الْحَيُّ', color: '#ffe0b2' },
        // { id: 51, text: 'الْقَيُّومُ', color: '#bbdefb' },
        // { id: 52, text: 'الْعَلِيُّ', color: '#cfd8dc' },
        // { id: 53, text: 'الْعَظِيمُ', color: '#ffe0b2' },
        // { id: 54, text: 'الْكَبِيرُ', color: '#f0f4c3' },
        // { id: 55, text: 'الْمُتَعَالِ', color: '#f8bbd0' },
        // { id: 56, text: 'اللَّطِيفُ', color: '#c5cae9' },
        // { id: 57, text: 'الْخَبِيرُ', color: '#dcedc8' },
        // { id: 58, text: 'الْوَهَّابُ', color: '#ffe0b2' },
        // { id: 59, text: 'الرَّزَّاقُ', color: '#bbdefb' },
        // { id: 60, text: 'الْحَسِيبُ', color: '#cfd8dc' },
        // { id: 61, text: 'الرَّقِيبُ', color: '#ffe0b2' },
        // { id: 62, text: 'الشَّهِيدُ', color: '#f0f4c3' },
        // { id: 63, text: 'الْمُقِيتُ', color: '#f8bbd0' },
        // { id: 64, text: 'الْفَتَّاحُ', color: '#c5cae9' },
        // { id: 65, text: 'الْعَلِيمُ', color: '#dcedc8' },
        // { id: 66, text: 'الْحَكِيمُ', color: '#ffe0b2' },
        // { id: 67, text: 'الْجَامِعُ', color: '#bbdefb' },
        // { id: 68, text: 'الْقَادِرُ', color: '#cfd8dc' },
        // { id: 69, text: 'الْمُقْتَدِرُ', color: '#ffe0b2' },
        // { id: 70, text: 'الفاطر', color: '#f0f4c3' },
        // { id: 71, text: 'العالم', color: '#f8bbd0' },
        // { id: 72, text: 'البديع', color: '#c5cae9' },
        // { id: 73, text: 'النور', color: '#dcedc8' },
        // { id: 74, text: 'الْوَاحِدُ', color: '#ffe0b2' },
        // { id: 75, text: 'الْأَحَدُ', color: '#bbdefb' },
        // { id: 76, text: 'الصَّمَدُ', color: '#cfd8dc' },
        // { id: 77, text: 'الْقَاهِرُ', color: '#ffe0b2' },
        // { id: 78, text: 'الْقَهَّارُ', color: '#f0f4c3' },
        // { id: 79, text: 'الْعَالِمُ', color: '#f8bbd0' },
        // { id: 80, text: 'الْحَكَمُ', color: '#c5cae9' },
        // { id: 81, text: 'الْإِلَهُ', color: '#dcedc8' },
        // { id: 82, text: 'الْحَفِيُّ', color: '#ffe0b2' },
        // { id: 83, text: 'الْوَدُودُ', color: '#bbdefb' },
        // { id: 84, text: 'الْحَافِظُ', color: '#cfd8dc' },
        // { id: 85, text: 'الْحَفِيظُ', color: '#ffe0b2' },
        // { id: 86, text: 'الْغَالِبُ', color: '#f0f4c3' },
        // { id: 87, text: 'الْكَافِي', color: '#f8bbd0' },
        // { id: 88, text: 'الْمَنَّانُ', color: '#c5cae9' },
        // { id: 89, text: 'الْمُسْتَعَانُ', color: '#dcedc8' },
        // { id: 90, text: 'الْوَارِثُ', color: '#ffe0b2' },
        // { id: 91, text: 'الْكَفِيلُ', color: '#bbdefb' },
        // { id: 92, text: 'الْوَكِيلُ', color: '#cfd8dc' },
        // { id: 93, text: 'الْغَفَّارُ', color: '#ffe0b2' },
        // { id: 94, text: 'الْكَرِيمُ', color: '#f0f4c3' },
        // { id: 95, text: 'الشَّكُورُ', color: '#f8bbd0' },
        // { id: 96, text: 'الْأَعْلَى', color: '#c5cae9' },
        // { id: 97, text: 'الْأَكْرَمُ', color: '#dcedc8' },
        // { id: 98, text: 'مَالِكُ الْمُلْكِ', color: '#ffe0b2' },
        // { id: 99, text: 'ذُو الْجَلَالِ وَالْإِكْرَامِ', color: '#bbdefb' }
    ],

    favourites: [],
    
    addToFavourites: (thekr: thekrType) =>
        set((state) => ({
            favourites: [...state.favourites, thekr],
        })),


        decrementCounter: (itemId: number | string, contentId: number | string) =>
            set((state) => ({
                element: state.element.map((item) =>
                    item.id === itemId
                        ? {
                                ...item,
                                content: item.content.map((content) =>
                                    content.textId === contentId
                                      ? { ...content, counter: Math.max(content.counter - 1, 0) } // Ensure counter doesn't go below 0
                                        : content
                                ),
                            }
                        : item
                ),
            })),

    
}));

export default useElementStore;