import { create } from 'zustand';

export type duaType ={
    id: number | string 
    title: string;
    description: string;
 
}

export type thekrType = {
    textId: number | string;
    text: string;
    counter: number;
}
export type ElementType = {
    id: number | string;
    title: string;
    content: thekrType[];

};



export type ElementStore = {
    element: ElementType[];
    favourites: thekrType[];
    dua: duaType[];
    addToFavourites: (ele: thekrType) => void;
    decrementCounter: (itemId: number | string, contentId: number | string) => void 
    namesOfAllah: { id: number; text: string; color: string, description: string }[];
};

const useElementStore = create<ElementStore>((set) => ({
    element: [
        {
            id: 1,
            title: 'أذكـار الصباح',
            content: [
                {
                    textId: 1,
                    text: `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].`,
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 4
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 3
                },
            ],
        },
        {
            id: 2,
            title: 'أذكـار المساء',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 3,
            title: 'أذكـار بعد الصلاة',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 4,
            title: 'أذكـار النوم',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 5,
            title: 'أذكـار الاستيقاظ',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 6,
            title: 'أذكـار الآذان',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 7,
            title: 'أذكـار خروج الـمنزل ودخولـه',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
    ],

    dua: [
        {   
            id: 1,
            title: "دعاء دخول الجنة ",
            description: "اللَّهمَّ إنِّي أسألُكَ الجنَّةَ وما قرَّبَ إليها من قَولٍ أو عملٍ، وأعوذُ بِكَ منَ النَّارِ وما قرَّبَ إليها من قولٍ أو عملٍ، وأسألُكَ أن تجعلَ كلَّ قَضاءٍ قضيتَهُ لي خيرًا",
            
        },
        {
            id: 2,
            title: "دعاء السفر",
            description: "اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب وسوء المنظر في الأهل والمال آيبون تائبون عابدون ولربنا حامدون",
            
        }
        
    ],


    namesOfAllah: [
        { id: 1, text: 'الله', color: '#c5e3e9', description: 'الاسم الذي يدلّ على ذات الله -تعالى- الجامعة لصفات ألوهيّته.' },
        { id: 2, text: 'الرحمن', color: '#d8e9c5', description: 'الاسم الذي يدلّ على شمول رحمته كافّة خَلقه؛ بأن خلقهم ورزقهم، وهو اسم يختص به الله -تعالى- ولا يجوز أن يُطلَق على أحد غيره.[٢]' },
        { id: 3, text: 'الرحيم', color: '#b1bace', description: 'اسم خاصّ برحمة الله -تعالى- بعباده المؤمنين؛ بهدايتهم للإيمان وإثابتهم الثواب الدائم في الآخرة.[٢]' },
        { id: 4, text: 'الملك', color: '#d7ccc8', description: 'الملك لغة هو الشدّ والربط فيُقال: ملكت العجين؛ أي شددت عجنه، فالملك هو الذي يكون الأمر في ملكه يعود له، وهو أعمّ من المالك فليس كل مالك أمره نافذ في ملكه، والله -تعالى- مالك المالكين لأنّ تصرفهم في أملاكهم ما كان إلّا بإذنه.[٢]' },
        { id: 5, text: 'القدوس', color: '#ffe0b2', description: 'المُنزّه عن كل ما يُمكن أن يُدركه حسّ الإنسان أو خياله من الأوصاف.' },
        { id: 6, text: 'السلام', color: '#fff9c4', description: 'السالم من جميع العيوب والصفات الناقصة، وهو الذي يعمّم السلامة على خلقه.' },
        { id: 7, text: 'المؤمن', color: '#f8bbd0', description: 'المُصدِّق لجميع ما تقوله نفسه وكتبه ورسله عنه.' },
        { id: 8, text: 'المهيمن', color: '#c8e6c9', description: 'المُسيطر بقدرته الكاملة على كل شيء.' },
        { id: 9, text: 'العزيز', color: '#d1c4e9', description: 'الغالب الذي لا نظير ولا مثيل له' },
        { id: 10, text: 'الجبار', color: '#ffccbc', description: 'المُنفِّذ بطريق الإجبار والجبر لمشيئته وإرادته في كلّ ما يريد.' },
        { id: 11, text: 'المتكبر', color: '#bbdefb', description: 'المُتفرِّد بجميع صفات الكبرياء والعظمة، المُترفِّع عن الحاجة والنقص.' },
        { id: 12, text: 'الخالق', color: '#cfd8dc', description: 'المُبدِع في خلقه، وذلك بإرادته.' },
        { id: 13, text: 'البارئ', color: '#ffe0b2', description: 'المُميِّز للمخلوقين حتّى مع اختلاف صورهم.' },
        { id: 14, text: 'المصور', color: '#f0f4c3', description: 'المعطي لكلّ خلقٍ من خلقه صورة مختلفة عن الأخرى.' },
        { id: 15, text: 'الوليّ', color: '#f8bbd0', description: 'الناصر والمُصلح لشؤون عباده والمُثني عليهم؛ فالله -تعالى- هو وليّ المؤمنين؛ فينصرهم ويتولّى أمرهم ويختصّهم برحمته، قال -تعالى-: (اللَّـهُ وَلِيُّ الَّذِينَ آمَنُوا)،[٣] وولاية الله للمؤمنين ليست كغيرها قال -تعالى-: (لَيْسَ كَمِثْلِهِ شَيْءٌ)،[٤] فهو مالك التدبير، ويتولّى أمر العالم وجميع خَلقه؛ فجعل للمؤمنين ما ينفعهم في دينهم ودنياهم وآخرتهم.[٥] وإن كان الله -تعالى- قد أنعم على غير المؤمنين كما أنعم على المؤمنين فليس ذلك أنّ الله وليّ غير المؤمنين؛ فهم قابلوا نعمه بالجحود، كما أنّ النصرة والثناء من معاني الوليّ والله -تعالى- لا ينصرهم ولا يُثني عليهم، فأولياء غير المؤمنين هي أصنامهم وطواغيتهم، قال -تعالى-: (وَالَّذِينَ كَفَرُوا أَوْلِيَاؤُهُمُ الطَّاغُوتُ).[٣][٥]' },
        { id: 16, text: 'المولى', color: '#c5cae9', description: 'المالك والسيّد ومَن يُرتجى منه النصر والمعونة، والله -تعالى- هو أفضل مولى للمؤمنين؛ فهو يتولّاهم بتيسير مصالحهم ومنافعهم وتدبّر شؤونهم، قال -تعالى-: (وَاعْتَصِمُوا بِاللَّـهِ هُوَ مَوْلَاكُمْ فَنِعْمَ الْمَوْلَى).[٦][٥]' },
        { id: 17, text: 'النصير', color: '#dcedc8', description: 'النصير؛ أي المُعين على العدوّ، والله -تعالى- نصير للمؤمن؛ أي ناصره ومُعينه على عدوّه، والمؤمن نصير الله -تعالى-؛ أي مُعان ومنصور من عند الله -تعالى- أو ناصره بالامتثال لأوامره واجتناب نواهيه وحفظ حدوده، قال -تعالى-: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنصَارَ اللَّـهِ).[٧][٥]' },
        { id: 18, text: 'القريب', color: '#ffe0b2', description: 'القريب الذي ليس ببعيد، وقرب الله -تعالى- من عباده عامّ وخاصّ؛ أمّا القرب العام فهو قريب ومحيط بكل شيء ويعلمه؛ فهو أقرب للإنسان من حبل وريده، قال -تعالى: (وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ)،[٨] ويأتي القرب أيضاً بمعنى المعيًة العامّة، قال -تعالى-: (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ)،[٩] وأمّا القرب الخاص فهو قرب يقتضي المحبّة والتأييد والنصرة للداعيين والعابدين، ومن ذلك إجابة دعائهم، قال -تعالى-: (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ)،[١٠] كما ويقبل -عزّ وجلّ- توبتهم واستغفارهم، قال -تعالى-: (فَاستَغفِروهُ ثُمَّ توبوا إِلَيهِ إِنَّ رَبّي قَريبٌ).[١١][٥]' },
        { id: 19, text: 'المجيب', color: '#bbdefb', description: 'اسم فاعل من الفعل أجاب؛ فالله -تعالى- مجيبٌ لدعاء عباده، قال -تعالى-: (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ)،[١٠] فهو يجيب المضطر ويُغيث الملهوف ويُقابل الدعاء بالإجابة، ويقابل حاجة المضطر بالكفاية، كما أنّه يُنعم ويتفضّل قبل النداء والدعاء.[٥]' },
        { id: 20, text: 'السميع', color: '#cfd8dc', description: 'السامع لكنّ السميع أبلغ في الصفة، وسمع الله -تعالى- نوعان؛ أوّلهما أنّه يسمع جميع الأصوات الظاهرة والباطنة؛ الخفيّة والجليّة، وثانيهما السماع بمعنى إجابة دعاء السائلين والعابدين، قال -تعالى-: (إِنَّ رَبّي لَسَميعُ الدُّعاءِ)،[١٢]' }
    ],

    favourites: [],
    
    addToFavourites: (thekr: thekrType) =>
        set((state) => ({
            favourites: [...state.favourites, thekr],
        })),


        decrementCounter: (itemId: number | string, contentId: number | string) =>
            set((state) => ({
                element: state.element.map((item) =>
                    item.id === itemId
                        ? {
                                ...item,
                                content: item.content.map((content) =>
                                    content.textId === contentId
                                      ? { ...content, counter: Math.max(content.counter - 1, 0) } // Ensure counter doesn't go below 0
                                        : content
                                ),
                            }
                        : item
                ),
            })),

    
}));

export default useElementStore;