import { create } from 'zustand';

export type thekrType = {
    textId: number | string;
    text: string;
    counter: number 
}
export type ElementType = {
    id: number | string;
    title: string;
    content: thekrType[];
};

export type ElementStore = {
    element: ElementType[];
    favourites: thekrType[];
    addToFavourites: (element: thekrType) => void;
    // counterForAzkar: (element: thekrType) => void;
};

const useElementStore = create<ElementStore>((set) => ({
    element: [
        {
            id: 1,
            title: 'أذكـار الصباح',
            content: [
                {
                    textId: 1,
                    text: 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 4
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 3
                },
            ],
        },
        {
            id: 2,
            title: 'أذكـار المساء',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 3,
            title: 'أذكـار بعد الصلاة',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 4,
            title: 'أذكـار النوم',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 5,
            title: 'أذكـار الاستيقاظ',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 6,
            title: 'أذكـار الآذان',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
        {
            id: 7,
            title: 'أذكـار خروج الـمنزل ودخولـه',
            content: [
                {
                    textId: 1,
                    text: ' أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ - اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
                    counter: 1
                },
                {
                    textId: 2,
                    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة.',
                    counter: 1
                },
                {
                    textId: 3,
                    text: 'اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.',
                    counter: 1
                },
            ],
        },
    ],
    favourites: [],
    addToFavourites: (thekr: thekrType) =>
        set((state) => ({
            favourites: [...state.favourites, thekr],
        })),

    
}));

export default useElementStore;